### Importing libraries

In [35]:
import numpy as np
import pandas as pd

### DataFrames
Getting all sheets separatly

In [36]:
xls = pd.ExcelFile('May17.xlsx')
df1 = xls.parse(0)
df2 = xls.parse(1)
df3 = xls.parse(2)

#Keeing just first sheet
df1[:9]

,Unnamed: 0,kaber,Unnamed: 2,PETTY CASH RECORD,Unnamed: 4,Unnamed: 5,Unnamed: 6
0,DATE,NaN,DR,NaN,CR,NaN,NaN
1,NaN,Description,Received cash,description,Paid cash,Balance,NaN
2,2017-05-01 00:00:00,opening balance,400,NaN,NaN,400,NaN
3,2017-05-01 00:00:00,cash withdrawl/Noor bank,4000,Paid Majid,3000,1400,NaN
4,2017-05-01 00:00:00,cash chq#106139,60000,Paid Utam,644,63356,NaN
5,2017-05-01 00:00:00,NaN,NaN,Paid Utam,30000,30000,NaN
6,2017-05-01 00:00:00,NaN,NaN,Ply wood,1520,-1520,NaN
7,2017-05-01 00:00:00,NaN,NaN,Al saray building/suplier,10000,-10000,NaN
8,2017-05-01 00:00:00,NaN,NaN,shine sus co/sub contracter,30000,-30000,NaN

Dropping unwanted rows/cols

In [37]:
#Removing NaN column
df1.drop(df1.columns[[6]],inplace=True, axis=1)

#Removing First Row
df1 = df1[1:]
df1[:9]

,Unnamed: 0,kaber,Unnamed: 2,PETTY CASH RECORD,Unnamed: 4,Unnamed: 5
1,NaN,Description,Received cash,description,Paid cash,Balance
2,2017-05-01 00:00:00,opening balance,400,NaN,NaN,400
3,2017-05-01 00:00:00,cash withdrawl/Noor bank,4000,Paid Majid,3000,1400
4,2017-05-01 00:00:00,cash chq#106139,60000,Paid Utam,644,63356
5,2017-05-01 00:00:00,NaN,NaN,Paid Utam,30000,30000
6,2017-05-01 00:00:00,NaN,NaN,Ply wood,1520,-1520
7,2017-05-01 00:00:00,NaN,NaN,Al saray building/suplier,10000,-10000
8,2017-05-01 00:00:00,NaN,NaN,shine sus co/sub contracter,30000,-30000
9,2017-05-02 00:00:00,cash withdrawl/Noor bank,9000,Paid Utam,15480,-6480

In [38]:
#Changing First row as the keys
df1.columns = df1.iloc[0]
df1 = df1[1:]

#Renaming date
df1.columns.values[0] = "Date"
df1[0:9]

1,Date,Description,Received cash,description,Paid cash,Balance
2,2017-05-01 00:00:00,opening balance,400,NaN,NaN,400
3,2017-05-01 00:00:00,cash withdrawl/Noor bank,4000,Paid Majid,3000,1400
4,2017-05-01 00:00:00,cash chq#106139,60000,Paid Utam,644,63356
5,2017-05-01 00:00:00,NaN,NaN,Paid Utam,30000,30000
6,2017-05-01 00:00:00,NaN,NaN,Ply wood,1520,-1520
7,2017-05-01 00:00:00,NaN,NaN,Al saray building/suplier,10000,-10000
8,2017-05-01 00:00:00,NaN,NaN,shine sus co/sub contracter,30000,-30000
9,2017-05-02 00:00:00,cash withdrawl/Noor bank,9000,Paid Utam,15480,-6480
10,2017-05-02 00:00:00,cash withdrawl/Noor bank,10000,Deposit ADIB,9000,10000

In [43]:
#Fill NaN values with space
df1.iloc[:,[1,3]]=df1.fillna(' ')

#Concatinating 2 descriptions
df1.iloc[:,1] = df1.iloc[:,1] + ", " + df1.iloc[:,3]
df1[0:9]

1,Date,Description,Received cash,description,Paid cash,Balance
2,2017-05-01 00:00:00,"opening balance,",400,,NaN,400
3,2017-05-01 00:00:00,"cash withdrawl/Noor bank, Paid Majid",4000,Paid Majid,3000,1400
4,2017-05-01 00:00:00,"cash chq#106139, Paid Utam",60000,Paid Utam,644,63356
5,2017-05-01 00:00:00,", Paid Utam",NaN,Paid Utam,30000,30000
6,2017-05-01 00:00:00,", Ply wood",NaN,Ply wood,1520,-1520
7,2017-05-01 00:00:00,", Al saray building/suplier",NaN,Al saray building/suplier,10000,-10000
8,2017-05-01 00:00:00,", shine sus co/sub contracter",NaN,shine sus co/sub contracter,30000,-30000
9,2017-05-02 00:00:00,"cash withdrawl/Noor bank, Paid Utam",9000,Paid Utam,15480,-6480
10,2017-05-02 00:00:00,"cash withdrawl/Noor bank, Deposit ADIB",10000,Deposit ADIB,9000,10000

In [44]:
#Drop second Description
df1.drop(df1.columns[[3]],inplace=True, axis=1)
df1[0:9]

1,Date,Description,Received cash,Paid cash,Balance
2,2017-05-01 00:00:00,"opening balance,",400,NaN,400
3,2017-05-01 00:00:00,"cash withdrawl/Noor bank, Paid Majid",4000,3000,1400
4,2017-05-01 00:00:00,"cash chq#106139, Paid Utam",60000,644,63356
5,2017-05-01 00:00:00,", Paid Utam",NaN,30000,30000
6,2017-05-01 00:00:00,", Ply wood",NaN,1520,-1520
7,2017-05-01 00:00:00,", Al saray building/suplier",NaN,10000,-10000
8,2017-05-01 00:00:00,", shine sus co/sub contracter",NaN,30000,-30000
9,2017-05-02 00:00:00,"cash withdrawl/Noor bank, Paid Utam",9000,15480,-6480
10,2017-05-02 00:00:00,"cash withdrawl/Noor bank, Deposit ADIB",10000,9000,10000

In [45]:
#Fill NaN number values with 0
df1.iloc[:,:]=df1.fillna('0')
df1[:9]

1,Date,Description,Received cash,Paid cash,Balance
2,2017-05-01 00:00:00,"opening balance,",400,0,400
3,2017-05-01 00:00:00,"cash withdrawl/Noor bank, Paid Majid",4000,3000,1400
4,2017-05-01 00:00:00,"cash chq#106139, Paid Utam",60000,644,63356
5,2017-05-01 00:00:00,", Paid Utam",0,30000,30000
6,2017-05-01 00:00:00,", Ply wood",0,1520,-1520
7,2017-05-01 00:00:00,", Al saray building/suplier",0,10000,-10000
8,2017-05-01 00:00:00,", shine sus co/sub contracter",0,30000,-30000
9,2017-05-02 00:00:00,"cash withdrawl/Noor bank, Paid Utam",9000,15480,-6480
10,2017-05-02 00:00:00,"cash withdrawl/Noor bank, Deposit ADIB",10000,9000,10000